Swasly/FE6_BMS/alpaca-bms/alpaca-bms.cydsn/Generated_Source/PSoC5/SOC_Timer.c
/*******************************************************************************
* File Name: SOC_Timer.c
* Version 2.70
*
* Description:
*  The Timer component consists of a 8, 16, 24 or 32-bit timer with
*  a selectable period between 2 and 2^Width - 1.  The timer may free run
*  or be used as a capture timer as well.  The capture can be initiated
*  by a positive or negative edge signal as well as via software.
*  A trigger input can be programmed to enable the timer on rising edge
*  falling edge, either edge or continous run.
*  Interrupts may be generated due to a terminal count condition
*  or a capture event.
*
* Note:
*
********************************************************************************
* Copyright 2008-2014, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#include "SOC_Timer.h"

uint8 SOC_Timer_initVar = 0u;


/*******************************************************************************
* Function Name: SOC_Timer_Init
********************************************************************************
*
* Summary:
*  Initialize to the schematic state
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_Init(void) 
{
    #if(!SOC_Timer_UsingFixedFunction)
            /* Interrupt State Backup for Critical Region*/
            uint8 SOC_Timer_interruptState;
    #endif /* Interrupt state back up for Fixed Function only */

    #if (SOC_Timer_UsingFixedFunction)
        /* Clear all bits but the enable bit (if it's already set) for Timer operation */
        SOC_Timer_CONTROL &= SOC_Timer_CTRL_ENABLE;

        /* Clear the mode bits for continuous run mode */
        #if (CY_PSOC5A)
            SOC_Timer_CONTROL2 &= ((uint8)(~SOC_Timer_CTRL_MODE_MASK));
        #endif /* Clear bits in CONTROL2 only in PSOC5A */

        #if (CY_PSOC3 || CY_PSOC5LP)
            SOC_Timer_CONTROL3 &= ((uint8)(~SOC_Timer_CTRL_MODE_MASK));
        #endif /* CONTROL3 register exists only in PSoC3 OR PSoC5LP */

        /* Check if One Shot mode is enabled i.e. RunMode !=0*/
        #if (SOC_Timer_RunModeUsed != 0x0u)
            /* Set 3rd bit of Control register to enable one shot mode */
            SOC_Timer_CONTROL |= 0x04u;
        #endif /* One Shot enabled only when RunModeUsed is not Continuous*/

        #if (SOC_Timer_RunModeUsed == 2)
            #if (CY_PSOC5A)
                /* Set last 2 bits of control2 register if one shot(halt on
                interrupt) is enabled*/
                SOC_Timer_CONTROL2 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Set last 2 bits of control3 register if one shot(halt on
                interrupt) is enabled*/
                SOC_Timer_CONTROL3 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL3 for PSoC3 or PSoC5LP */

        #endif /* Remove section if One Shot Halt on Interrupt is not enabled */

        #if (SOC_Timer_UsingHWEnable != 0)
            #if (CY_PSOC5A)
                /* Set the default Run Mode of the Timer to Continuous */
                SOC_Timer_CONTROL2 |= SOC_Timer_CTRL_MODE_PULSEWIDTH;
            #endif /* Set Continuous Run Mode in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Clear and Set ROD and COD bits of CFG2 register */
                SOC_Timer_CONTROL3 &= ((uint8)(~SOC_Timer_CTRL_RCOD_MASK));
                SOC_Timer_CONTROL3 |= SOC_Timer_CTRL_RCOD;

                /* Clear and Enable the HW enable bit in CFG2 register */
                SOC_Timer_CONTROL3 &= ((uint8)(~SOC_Timer_CTRL_ENBL_MASK));
                SOC_Timer_CONTROL3 |= SOC_Timer_CTRL_ENBL;

                /* Set the default Run Mode of the Timer to Continuous */
                SOC_Timer_CONTROL3 |= SOC_Timer_CTRL_MODE_CONTINUOUS;
            #endif /* Set Continuous Run Mode in CONTROL3 for PSoC3ES3 or PSoC5A */

        #endif /* Configure Run Mode with hardware enable */

        /* Clear and Set SYNCTC and SYNCCMP bits of RT1 register */
        SOC_Timer_RT1 &= ((uint8)(~SOC_Timer_RT1_MASK));
        SOC_Timer_RT1 |= SOC_Timer_SYNC;

        /*Enable DSI Sync all all inputs of the Timer*/
        SOC_Timer_RT1 &= ((uint8)(~SOC_Timer_SYNCDSI_MASK));
        SOC_Timer_RT1 |= SOC_Timer_SYNCDSI_EN;

        /* Set the IRQ to use the status register interrupts */
        SOC_Timer_CONTROL2 |= SOC_Timer_CTRL2_IRQ_SEL;
    #endif /* Configuring registers of fixed function implementation */

    /* Set Initial values from Configuration */
    SOC_Timer_WritePeriod(SOC_Timer_INIT_PERIOD);
    SOC_Timer_WriteCounter(SOC_Timer_INIT_PERIOD);

    #if (SOC_Timer_UsingHWCaptureCounter)/* Capture counter is enabled */
        SOC_Timer_CAPTURE_COUNT_CTRL |= SOC_Timer_CNTR_ENABLE;
        SOC_Timer_SetCaptureCount(SOC_Timer_INIT_CAPTURE_COUNT);
    #endif /* Configure capture counter value */

    #if (!SOC_Timer_UsingFixedFunction)
        #if (SOC_Timer_SoftwareCaptureMode)
            SOC_Timer_SetCaptureMode(SOC_Timer_INIT_CAPTURE_MODE);
        #endif /* Set Capture Mode for UDB implementation if capture mode is software controlled */

        #if (SOC_Timer_SoftwareTriggerMode)
            #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED)
                if (0u == (SOC_Timer_CONTROL & SOC_Timer__B_TIMER__TM_SOFTWARE))
                {
                    SOC_Timer_SetTriggerMode(SOC_Timer_INIT_TRIGGER_MODE);
                }
            #endif /* (!SOC_Timer_UDB_CONTROL_REG_REMOVED) */
        #endif /* Set trigger mode for UDB Implementation if trigger mode is software controlled */

        /* CyEnterCriticalRegion and CyExitCriticalRegion are used to mark following region critical*/
        /* Enter Critical Region*/
        SOC_Timer_interruptState = CyEnterCriticalSection();

        /* Use the interrupt output of the status register for IRQ output */
        SOC_Timer_STATUS_AUX_CTRL |= SOC_Timer_STATUS_ACTL_INT_EN_MASK;

