Swasly/FE6_BMS/alpaca-bms/alpaca-bms.cydsn/Generated_Source/PSoC5/SOC_Timer.c
        /* Exit Critical Region*/
        CyExitCriticalSection(SOC_Timer_interruptState);

        #if (SOC_Timer_EnableTriggerMode)
            SOC_Timer_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/
		
		
        #if (SOC_Timer_InterruptOnCaptureCount && !SOC_Timer_UDB_CONTROL_REG_REMOVED)
            SOC_Timer_SetInterruptCount(SOC_Timer_INIT_INT_CAPTURE_COUNT);
        #endif /* Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        SOC_Timer_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    SOC_Timer_SetInterruptMode(SOC_Timer_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: SOC_Timer_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (SOC_Timer_UsingFixedFunction)
        SOC_Timer_GLOBAL_ENABLE |= SOC_Timer_BLOCK_EN_MASK;
        SOC_Timer_GLOBAL_STBY_ENABLE |= SOC_Timer_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED || SOC_Timer_UsingFixedFunction)
        SOC_Timer_CONTROL |= SOC_Timer_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: SOC_Timer_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  SOC_Timer_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void SOC_Timer_Start(void) 
{
    if(SOC_Timer_initVar == 0u)
    {
        SOC_Timer_Init();

        SOC_Timer_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    SOC_Timer_Enable();
}


/*******************************************************************************
* Function Name: SOC_Timer_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void SOC_Timer_Stop(void) 
{
    /* Disable Timer */
    #if(!SOC_Timer_UDB_CONTROL_REG_REMOVED || SOC_Timer_UsingFixedFunction)
        SOC_Timer_CONTROL &= ((uint8)(~SOC_Timer_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (SOC_Timer_UsingFixedFunction)
        SOC_Timer_GLOBAL_ENABLE &= ((uint8)(~SOC_Timer_BLOCK_EN_MASK));
        SOC_Timer_GLOBAL_STBY_ENABLE &= ((uint8)(~SOC_Timer_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: SOC_Timer_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_SetInterruptMode(uint8 interruptMode) 
{
    SOC_Timer_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: SOC_Timer_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void SOC_Timer_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    #if(SOC_Timer_UsingFixedFunction)
        (void)CY_GET_REG16(SOC_Timer_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(SOC_Timer_COUNTER_LSB_PTR_8BIT);
    #endif/* (SOC_Timer_UsingFixedFunction) */
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: SOC_Timer_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   SOC_Timer_ReadStatusRegister(void) 
{
    return (SOC_Timer_STATUS);
}


#if (!SOC_Timer_UDB_CONTROL_REG_REMOVED) /* Remove API if control register is unused */


