Swasly/FE6_BMS/alpaca-bms/alpaca-bms.cydsn/Generated_Source/PSoC5/SOC_Timer.c
/*******************************************************************************
* Function Name: SOC_Timer_ReadControlRegister
********************************************************************************
*
* Summary:
*  Reads the control register and returns it's value.
*
* Parameters:
*  void
*
* Return:
*  The contents of the control register
*
*******************************************************************************/
uint8 SOC_Timer_ReadControlRegister(void) 
{
    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED) 
        return ((uint8)SOC_Timer_CONTROL);
    #else
        return (0);
    #endif /* (!SOC_Timer_UDB_CONTROL_REG_REMOVED) */
}


/*******************************************************************************
* Function Name: SOC_Timer_WriteControlRegister
********************************************************************************
*
* Summary:
*  Sets the bit-field of the control register.
*
* Parameters:
*  control: The contents of the control register
*
* Return:
*
*******************************************************************************/
void SOC_Timer_WriteControlRegister(uint8 control) 
{
    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED) 
        SOC_Timer_CONTROL = control;
    #else
        control = 0u;
    #endif /* (!SOC_Timer_UDB_CONTROL_REG_REMOVED) */
}

#endif /* Remove API if control register is unused */


/*******************************************************************************
* Function Name: SOC_Timer_ReadPeriod
********************************************************************************
*
* Summary:
*  This function returns the current value of the Period.
*
* Parameters:
*  void
*
* Return:
*  The present value of the counter.
*
*******************************************************************************/
uint16 SOC_Timer_ReadPeriod(void) 
{
   #if(SOC_Timer_UsingFixedFunction)
       return ((uint16)CY_GET_REG16(SOC_Timer_PERIOD_LSB_PTR));
   #else
       return (CY_GET_REG16(SOC_Timer_PERIOD_LSB_PTR));
   #endif /* (SOC_Timer_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: SOC_Timer_WritePeriod
********************************************************************************
*
* Summary:
*  This function is used to change the period of the counter.  The new period
*  will be loaded the next time terminal count is detected.
*
* Parameters:
*  period: This value may be between 1 and (2^Resolution)-1.  A value of 0 will
*          result in the counter remaining at zero.
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_WritePeriod(uint16 period) 
{
    #if(SOC_Timer_UsingFixedFunction)
        uint16 period_temp = (uint16)period;
        CY_SET_REG16(SOC_Timer_PERIOD_LSB_PTR, period_temp);
    #else
        CY_SET_REG16(SOC_Timer_PERIOD_LSB_PTR, period);
    #endif /*Write Period value with appropriate resolution suffix depending on UDB or fixed function implementation */
}


/*******************************************************************************
* Function Name: SOC_Timer_ReadCapture
********************************************************************************
*
* Summary:
*  This function returns the last value captured.
*
* Parameters:
*  void
*
* Return:
*  Present Capture value.
*
*******************************************************************************/
uint16 SOC_Timer_ReadCapture(void) 
{
   #if(SOC_Timer_UsingFixedFunction)
       return ((uint16)CY_GET_REG16(SOC_Timer_CAPTURE_LSB_PTR));
   #else
       return (CY_GET_REG16(SOC_Timer_CAPTURE_LSB_PTR));
   #endif /* (SOC_Timer_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: SOC_Timer_WriteCounter
********************************************************************************
*
* Summary:
*  This funtion is used to set the counter to a specific value
*
* Parameters:
*  counter:  New counter value.
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_WriteCounter(uint16 counter) 
{
   #if(SOC_Timer_UsingFixedFunction)
        /* This functionality is removed until a FixedFunction HW update to
         * allow this register to be written
         */
        CY_SET_REG16(SOC_Timer_COUNTER_LSB_PTR, (uint16)counter);
        
    #else
        CY_SET_REG16(SOC_Timer_COUNTER_LSB_PTR, counter);
    #endif /* Set Write Counter only for the UDB implementation (Write Counter not available in fixed function Timer */
}


/*******************************************************************************
* Function Name: SOC_Timer_ReadCounter
********************************************************************************
*
* Summary:
*  This function returns the current counter value.
*
* Parameters:
*  void
*
* Return:
*  Present compare value.
*
*******************************************************************************/
uint16 SOC_Timer_ReadCounter(void) 
{
    /* Force capture by reading Accumulator */
    /* Must first do a software capture to be able to read the counter */
    /* It is up to the user code to make sure there isn't already captured data in the FIFO */
    #if(SOC_Timer_UsingFixedFunction)
        (void)CY_GET_REG16(SOC_Timer_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(SOC_Timer_COUNTER_LSB_PTR_8BIT);
    #endif/* (SOC_Timer_UsingFixedFunction) */

    /* Read the data from the FIFO (or capture register for Fixed Function)*/
    #if(SOC_Timer_UsingFixedFunction)
        return ((uint16)CY_GET_REG16(SOC_Timer_CAPTURE_LSB_PTR));
    #else
        return (CY_GET_REG16(SOC_Timer_CAPTURE_LSB_PTR));
    #endif /* (SOC_Timer_UsingFixedFunction) */
}


#if(!SOC_Timer_UsingFixedFunction) /* UDB Specific Functions */

    
