Swasly/FE6_BMS/alpaca-bms/alpaca-bms.cydsn/Generated_Source/PSoC5/SOC_Timer.c
/*******************************************************************************
 * The functions below this point are only available using the UDB
 * implementation.  If a feature is selected, then the API is enabled.
 ******************************************************************************/


#if (SOC_Timer_SoftwareCaptureMode)


/*******************************************************************************
* Function Name: SOC_Timer_SetCaptureMode
********************************************************************************
*
* Summary:
*  This function sets the capture mode to either rising or falling edge.
*
* Parameters:
*  captureMode: This parameter sets the capture mode of the UDB capture feature
*  The parameter values are defined using the
*  #define SOC_Timer__B_TIMER__CM_NONE 0
#define SOC_Timer__B_TIMER__CM_RISINGEDGE 1
#define SOC_Timer__B_TIMER__CM_FALLINGEDGE 2
#define SOC_Timer__B_TIMER__CM_EITHEREDGE 3
#define SOC_Timer__B_TIMER__CM_SOFTWARE 4
 identifiers
*  The following are the possible values of the parameter
*  SOC_Timer__B_TIMER__CM_NONE        - Set Capture mode to None
*  SOC_Timer__B_TIMER__CM_RISINGEDGE  - Rising edge of Capture input
*  SOC_Timer__B_TIMER__CM_FALLINGEDGE - Falling edge of Capture input
*  SOC_Timer__B_TIMER__CM_EITHEREDGE  - Either edge of Capture input
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_SetCaptureMode(uint8 captureMode) 
{
    /* This must only set to two bits of the control register associated */
    captureMode = ((uint8)((uint8)captureMode << SOC_Timer_CTRL_CAP_MODE_SHIFT));
    captureMode &= (SOC_Timer_CTRL_CAP_MODE_MASK);

    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        SOC_Timer_CONTROL &= ((uint8)(~SOC_Timer_CTRL_CAP_MODE_MASK));

        /* Write The New Setting */
        SOC_Timer_CONTROL |= captureMode;
    #endif /* (!SOC_Timer_UDB_CONTROL_REG_REMOVED) */
}
#endif /* Remove API if Capture Mode is not Software Controlled */


#if (SOC_Timer_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: SOC_Timer_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define SOC_Timer__B_TIMER__TM_NONE 0x00u
    #define SOC_Timer__B_TIMER__TM_RISINGEDGE 0x04u
    #define SOC_Timer__B_TIMER__TM_FALLINGEDGE 0x08u
    #define SOC_Timer__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define SOC_Timer__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= SOC_Timer_CTRL_TRIG_MODE_MASK;

    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
    
        /* Clear the Current Setting */
        SOC_Timer_CONTROL &= ((uint8)(~SOC_Timer_CTRL_TRIG_MODE_MASK));

        /* Write The New Setting */
        SOC_Timer_CONTROL |= (triggerMode | SOC_Timer__B_TIMER__TM_SOFTWARE);
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (SOC_Timer_EnableTriggerMode)


/*******************************************************************************
* Function Name: SOC_Timer_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_EnableTrigger(void) 
{
    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
        SOC_Timer_CONTROL |= SOC_Timer_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: SOC_Timer_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_DisableTrigger(void) 
{
    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED )   /* Remove assignment if control register is removed */
        SOC_Timer_CONTROL &= ((uint8)(~SOC_Timer_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */

#if(SOC_Timer_InterruptOnCaptureCount)


/*******************************************************************************
* Function Name: SOC_Timer_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= SOC_Timer_CTRL_INTCNT_MASK;

    #if (!SOC_Timer_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        SOC_Timer_CONTROL &= ((uint8)(~SOC_Timer_CTRL_INTCNT_MASK));
        /* Write The New Setting */
        SOC_Timer_CONTROL |= interruptCount;
    #endif /* (!SOC_Timer_UDB_CONTROL_REG_REMOVED) */
}
#endif /* SOC_Timer_InterruptOnCaptureCount */


#if (SOC_Timer_UsingHWCaptureCounter)


