Swasly/FE6_BMS/alpaca-bms/alpaca-bms.cydsn/Generated_Source/PSoC5/SOC_Timer.c
/*******************************************************************************
* Function Name: SOC_Timer_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_SetCaptureCount(uint8 captureCount) 
{
    SOC_Timer_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: SOC_Timer_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 SOC_Timer_ReadCaptureCount(void) 
{
    return ((uint8)SOC_Timer_CAP_COUNT);
}
#endif /* SOC_Timer_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: SOC_Timer_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void SOC_Timer_ClearFIFO(void) 
{
    while(0u != (SOC_Timer_ReadStatusRegister() & SOC_Timer_STATUS_FIFONEMP))
    {
        (void)SOC_Timer_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
